Revit 2027 API
RebarConstraintsStatus Enumeration
 Describes the status of the constraints
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarConstraintsStatus
Public Enumeration RebarConstraintsStatus
public enum class RebarConstraintsStatus
type RebarConstraintsStatus
Members
Member name | Value | Description
AllDisabled | 1 |  All constraints are disabled.
Enabled | 0 |  All constraints are enabled.
SomeDisabled | 2 |  Some constraints are disabled, and the others or enabled.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace